{"Property_type": "House", "Surbub": "Four Winds", "City": "Bulawayo South", "Province": "Bulawayo", "bedrooms": "3", "bathrooms": "3", "Description": "Land Size: 4500 sqm Property Tenure: Title Deeds/residential zoning Property Description: BUT 3 bed, 2 mes, 1 common bathroom Main bed-carpeted,bic, walk in dresser, en-suite (tub, shower head, shower head holder, whb, wc, water heater, vanity mirror) Bed 2-carpeted,bic, en-suite (cnr tub, shower head, shower head holder, whb, wc, vanity mirror), carpeted bedroom area, bics. Bed 3-parquet flooring, bics. Linen cupboard Study/store room Hallway-stone floor leads to polished verandah Common bathroom (shower, whb, vanity mirror) Separate toilet (wc) Lounge-polished stone floor, fp Dining room-polished stone floor Kitchen-ceramic tiled, fitted, formica counter tops, integrated flat 4 plate stove, oven & extractor. Scullery-ceramic tile Open verandah-ceiling, polished stone floor leads to braai space 2 x solar geysers Hybrid solar powered back up power system, 6 x solar panels  & 5 KVa inverter. Swimming pool-functional, fitted with evening lights Baby pool Outdoor cooking area for functions 2 x outdoor wc's for outdoor functions with single whb 2 x functional boreholes 3 jojo tanks-booster pumps, connected to the house, electricity and solar powered Fountain Pond DSQ SLUG Solar powered security lights throughout garden for evening functions Alarm sensors 8 x Security cameras around the house Alarm-linked to Fawcett reaction team Electric fence Motored gate Intercom Perimeter wall Land: Well manicured garden, lawn, plenty shade from ample tree cover, fairly flat gradient Additional Facts: Property utilization: Events venue, weddings, private parties Registered on Air BnB Owners wiling to sell including business  and some furniture. Located along Matopos Rd which leads to the popular Matopos Tourist & leisure Solid property, well looked after, full spec property Property is suitable for a family home with all the amenities in place, good for those who love entertaining. It is also suitable as an investment property-BnB, events venue (day & night) May be sold with some of the furniture by arrangement", "Listing_ref": "FAC216294", "amenities": ["Swimming Pool", "Borehole", "Carport", "Electric Fence", "Electric Gate", "Entertainment Area", "Fireplace", "Fitted Kitchen", "Garage", "Garden", "Good ZESA", "Main En Suite", "Municipal Water", "Parking bay", "Paved", "Solar System", "Study/Office", "Tiled", "Verandah", "Walled", "Water Tank", "Wooden Floor", "Fully Carpeted"], "Company": "fine-and-country", "Agent": "Fungayi Allen Katso", "Price": "298000", "building_area": "1800", "land_area": "4500", "listing_url": "https://www.property.co.zw//for-sale/townhouses-fac216294"}
{"Property_type": "House", "Surbub": "Mt Pleasant Heights", "City": "Harare West", "Province": "Harare", "bedrooms": "3", "bathrooms": "2", "Description": "*Mt Pleasant Northwood $320k* Oldy 3 beds, main ensuite, kitchen, lounge, dining, toilet/bath, staff quarters, carport for 2 cars, disused swimming pool, well, 5 x 2000l water tanks, walled and gated. Land area 4047sqm, deed", "Listing_ref": "TAGP213107", "amenities": ["Swimming Pool", "Carport", "Good ZESA", "Main En Suite", "Walled"], "Company": "tagmin", "Agent": "Benny Mpaso", "Price": "320000", "building_area": "4047", "land_area": "4047", "listing_url": "https://www.property.co.zw//for-sale/townhouses-tagp213107"}
{"Property_type": "House", "Surbub": "Ballantyne Park", "City": "Harare North", "Province": "Harare", "bedrooms": "5", "bathrooms": "4", "Description": "Sole mandate. Very Big and impressive split level home on approx. 9500sqm of land. 5 Bedrooms, 4 bathrooms (3 ensuite), plus 2 offices 2 very big lounges, dining room, 2 kitchens, walk – in pantry, laundry room. Double lockup garage and store room. Big entertainment area with Swimming pool. Large balconies, verandah. Very large garden, possibility for subdivision. 3 Staff rooms. 2 x 5000 liter water tanks, no borehole. Excellent location on Willowmead lane, close to amenities and schools.", "Listing_ref": "KNP214326", "amenities": ["Garage", "Main En Suite", "Staff Quarters", "Verandah", "Walled", "Water Tank"], "Company": "kennan-properties", "Agent": "Louvina Eggersglusz", "Price": "1400000", "building_area": "", "land_area": "9500", "listing_url": "https://www.property.co.zw//for-sale/houses-knp214326"}
{"Property_type": "House", "Surbub": "Mabelreign", "City": "Harare West", "Province": "Harare", "bedrooms": "3", "bathrooms": "1", "Description": "Investment Opportunity Solid family home comprises of 3 bedrooms, fitted kitchen, combined dining and lounge, bathroom and toilet. Cottage with 2 bedrooms, kitchen, bathroom and toilet. Walled and gated.  Title Deed.", "Listing_ref": "THRE205041", "amenities": ["Fireplace", "Fitted Kitchen", "Flatlet/Cottage", "Garden", "Good ZESA", "Municipal Water", "Paved", "Sewer System", "Tarred Roads", "Walled"], "Company": "tripple-horizon-real-estate", "Agent": "Oliver Tafa", "Price": "115000", "building_area": "900", "land_area": "900", "listing_url": "https://www.property.co.zw//for-sale/houses-thre205041"}
{"Property_type": "House", "Surbub": "Greendale North", "City": "Harare North", "Province": "Harare", "bedrooms": "3", "bathrooms": "2", "Description": "Welcome to your dream home nestled in the heart of Greendale North, Harare, where elegance meets functionality on a sprawling 4048 m² oasis. This immaculate 3-bedroom, 2-bathroom residence exudes warmth and sophistication with every step, boasting a 400 m² interior designed for modern living. Entertain with ease in the expansive living areas featuring a cozy fireplace and access to a wide verandah perfect for sundowners. The gourmet fitted kitchen will delight any culinary enthusiast, and the adjacent study/office ensures productivity in your personal workspace. This well-appointed property also offers a fully carpeted ambiance for comfort, complemented by air conditioning to beat the Harare heat. The Entertainment Area invites family and friends to gather and create lasting memories, all secured within a walled perimeter and safeguarded by an electric gate, electric fence, and a comprehensive burglar alarm system. For those in need of extra space, the flatlet/cottage provides an ideal solution. With convenience as a priority, benefit from reliable municipal water, a backup water tank, and good ZESA for uninterrupted power. The outdoor space is equally impressive with a lush garden, 3 roomed staff quarters, a double garage, additional carport, and ample parking bays catering to multiple vehicles. Situated on tarred roads with paved driveways, this property captures the essence of serene suburban living while being closely connected to urban amenities. Don't miss out on making this exquisite Greendale North residence your forever home.", "Listing_ref": "DIP216520", "amenities": ["Air Conditioning", "Burglar Alarm", "Carport", "Electric Fence", "Electric Gate", "Entertainment Area", "Fireplace", "Fitted Kitchen", "Flatlet/Cottage", "Fully Carpeted", "Garage", "Garden", "Good ZESA", "Internet Connection", "Main En Suite", "Municipal Water", "Parking bay", "Paved", "Staff Quarters", "Study/Office", "Tarred Roads", "Tiled", "Verandah", "Walled", "Water Tank"], "Company": "drewandfraser", "Agent": "Phillip Maruve", "Price": "360000", "building_area": "400", "land_area": "4048", "listing_url": "https://www.property.co.zw//for-sale/houses-dip216520"}
{"Property_type": "House", "Surbub": "Burnside", "City": "Bulawayo East", "Province": "Bulawayo", "bedrooms": "5", "bathrooms": "4", "Description": "Discover an exceptional opportunity with this luxurious 5800sqm property located in Burnside, Bulawayo. The main house showcases a striking angular design, topped with a vibrant red metal roof, harmoniously blending contemporary style with the surrounding greenery. The entrance, framed by solid wooden columns and stone steps, leads you into an enticing living space. Inside, five spacious bedrooms and bathrooms offer comfort and privacy, complemented by a cozy lounge, a dining room ideal for entertaining, and a functional office/study area. Outside, the expansive grounds provide ample room for gardens or recreational activities, bordered by a low wall that ensures privacy. Solar panels atop the roof highlight the property’s sustainable features, allowing for eco-friendly living. Additionally, the property includes two charming cottages, each with unique architectural designs—one reflecting traditional aesthetics and the other a modern flair. This estate, with its borehole for water supply and beautiful landscaping, is perfect for those seeking tranquility and luxury in Bulawayo.", "Listing_ref": "PGP217756", "amenities": ["Borehole", "Fitted Kitchen", "Good ZESA", "Gravel Roads", "Main En Suite", "Municipal Water", "Solar System", "Staff Quarters", "Study/Office", "Tiled", "Verandah", "Walled", "Water Tank"], "Company": "pam-golding", "Agent": "Melody Phakathi", "Price": "250000", "building_area": "900", "land_area": "5800", "listing_url": "https://www.property.co.zw//for-sale/cottages-pgp217756"}
{"Property_type": "House", "Surbub": "Matsheumhlope", "City": "Bulawayo East", "Province": "Bulawayo", "bedrooms": "7", "bathrooms": "3", "Description": "Discover an exceptional property in the sought-after Matshemhlope area, perfectly blending residential comfort with income-generating potential.located minutes from NUST University, this estate is ideal for families, investors , or renovators looking to unlock incredible value. The property features a 7-bedroom main house, each bedroom with its own en-suite bathroom, 3 spacious lounges, and a large dining room, perfect for family living or hosting guests. A 4-bedroom cottage offers flexibility for additional accommodation or rental income. Outside, the student accommodation includes 5 rooms, housing up to 10 students with shared kitchen and bathroom facilities, ensuring a reliable monthly income. Already operating as a successful BnB, this property offers immediate returns while also presenting a renovators dream project, with scope for upgrades to further enhance its appeal and profitability. Located in a high-demand area, this versatile estate is perfect for capitalizing on the thriving student and rental markets. Property Size in 4046sqm", "Listing_ref": "SBRE216063", "amenities": ["Double Storey", "Fireplace", "Fitted Kitchen", "Flatlet/Cottage", "Garage", "Garden", "Good ZESA", "Main En Suite", "Municipal Water", "Parking bay", "Paved", "Sewer System", "Staff Quarters", "Tiled", "Verandah", "Walled", "Water Tank"], "Company": "stonebridge-real-estate", "Agent": "Robeen ", "Price": "300000", "building_area": "1", "land_area": "1", "listing_url": "https://www.property.co.zw//for-sale/houses-sbre216063"}
{"Property_type": "House", "Surbub": "Emerald Hill", "City": "Harare West", "Province": "Harare", "bedrooms": "4", "bathrooms": "NULL", "Description": "NULL", "Listing_ref": "LEG213882", "amenities": ["Borehole", "Swimming Pool", "Entertainment Area", "Fitted Kitchen", "Garden", "Good ZESA", "Internet Connection", "Main En Suite", "Municipal Water", "Sewer System", "Tarred Roads", "Tiled", "Verandah", "Walled", "Water Tank"], "Company": "legacy-real-estate", "Agent": "Tendai Muchaka", "Price": "230000", "building_area": "2000", "land_area": "2000", "listing_url": "https://www.property.co.zw//for-sale/houses-leg213882"}
{"Property_type": "House", "Surbub": "Mabelreign", "City": "Harare West", "Province": "Harare", "bedrooms": "3", "bathrooms": "NULL", "Description": "Calling all investors and clients interested in this property not to miss.Are you looking for a spacious family home with room to grow? Look no further! This Neatly 3-bedroomed home boasts: •Spacious lounge and dining room •Fitted kitchen •Toilet and bathroom •5000l Water Tank Additional 3-bedroom cottage perfect for guests or tenants rather. This whole property sits on 1367 sqm walled and gated stand in an established neighborhood. In addition to the above, this property offers endless possibilities for expansion and renovation.", "Listing_ref": "GAT212552", "amenities": ["Borehole", "Fitted Kitchen", "Flatlet/Cottage", "Garage", "Good ZESA", "Tarred Roads", "Tiled", "Walled", "Water Tank"], "Company": "guest-and-tanner", "Agent": "Simbarashe Hove", "Price": "139000", "building_area": "", "land_area": "1367", "listing_url": "https://www.property.co.zw//for-sale/houses-gat212552"}
{"Property_type": "House", "Surbub": "Glen View", "City": "Harare High Density", "Province": "Harare", "bedrooms": "4", "bathrooms": "2", "Description": "NULL", "Listing_ref": "GRM218808", "amenities": ["Borehole", "Electric Fence", "Main En Suite", "Paved", "Sewer System", "Solar System", "Study/Office", "Tiled", "Walled", "Water Tank"], "Company": "graham-douglas", "Agent": "Eddie ", "Price": "50000", "building_area": "200", "land_area": "465", "listing_url": "https://www.property.co.zw//for-sale/houses-grm218808"}
{"Property_type": "House", "Surbub": "Borrowdale", "City": "Borrowdale", "Province": "Harare North", "bedrooms": "6", "bathrooms": "6", "Description": "Accepting Nostro. A must see! Solar system  is included in the price.This property boasts 6 bedrooms, a foyer that leads into the lounge, double garage, open kitchen, open dining, an entertainment area that overlooks a beautiful view, guest toilet, 6 bedrooms with en suite and balconies, study (carpeted), second lounge with balcony, laundry room, storeroom, master bedroom with balcony, fireplace, en suite, dressing area and an orchard. With a prolific borehole and 24-hour security in a gated community.", "Listing_ref": "SEF125762", "amenities": ["Borehole", "Double Storey", "Entertainment Area", "Fireplace", "Fitted Kitchen", "Garage", "Garden", "Good ZESA", "Internet Connection", "Main En Suite", "Solar System", "Study/Office", "Tiled", "Verandah", "Water Tank"], "Company": "seeff", "Agent": "Rumbi Mashamba", "Price": "550000", "building_area": "350", "land_area": "2600", "listing_url": "https://www.property.co.zw//for-sale/houses-sef125762"}
{"Property_type": "House", "Surbub": "Glen Lorne", "City": "Harare North", "Province": "Harare", "bedrooms": "4", "bathrooms": "3", "Description": "1,850 m² An incomplete modern architectural home in Glen Lorne (Mother Touch Area) that was designed with provision for: A large open-plan kitchen-living-dining area with open spaces for aluminium door and window frames. The spacious main bedroom (with walk-in closet and main bathroom). The second and third bedrooms share a full family bathroom and the fourth bedroom has an en suite bathroom. All the bedrooms have large opening areas for modern aluminium frames and windows and space for built in cupboards The inside space is also designed with the provision of extra linen cupboards in the hallway, pantry, scullery, entry hall, guest toilet, and a double lock-up garage that can be converted into an extra-large guest room. To suit the buyer's preferences, the house needs finishings like tiling, inside plastering and a ceiling. Features A 5000l tank, tank stand, walled and gated. The stand size measures 1 850 square metres. NOSTRO ACCEPTED", "Listing_ref": "LCRE207829", "amenities": ["Garage", "Garden", "Main En Suite", "Tarred Roads", "Walled"], "Company": "lucile", "Agent": "Arthur Makaza", "Price": "200000", "building_area": "", "land_area": "1850", "listing_url": "https://www.property.co.zw//for-sale/houses-lcre207829"}
{"Property_type": "House", "Surbub": "Suburbs", "City": "Bulawayo East", "Province": "Bulawayo", "bedrooms": "3", "bathrooms": "NULL", "Description": "NULL", "Listing_ref": "NWGP215452", "amenities": ["Borehole", "Carport", "Entertainment Area", "Fireplace", "Garage", "Garden", "Good ZESA", "Internet Connection", "Municipal Water", "Paved", "Sewer System", "Tarred Roads", "Tiled", "Verandah", "Water Tank"], "Company": "newage", "Agent": "New Age Properties", "Price": "180000", "building_area": "", "land_area": "2980", "listing_url": "https://www.property.co.zw//for-sale/houses-nwgp215452"}
{"Property_type": "House", "Surbub": "Cowdray Park", "City": "Bulawayo High-Density", "Province": "Bulawayo", "bedrooms": "3", "bathrooms": "2", "Description": "NULL", "Listing_ref": "RANG212180", "amenities": ["Gravel Roads", "Main En Suite", "Municipal Water", "Sewer System", "Verandah"], "Company": "ranangaproperties", "Agent": "Vivian K.N", "Price": "15000", "building_area": "80", "land_area": "200", "listing_url": "https://www.property.co.zw//for-sale/houses-rang212180"}
{"Property_type": "House", "Surbub": "Suburbs", "City": "Bulawayo East", "Province": "Bulawayo", "bedrooms": "3", "bathrooms": "2", "Description": "Located in one of the most sought-after neighbourhoods with a reliable water table, this well-positioned 3-bedroom home sits on a 3,000sqm stand in an area that has become increasingly commercial. Previously rented by doctors, the property is well-suited for residential living or professional offices. The home includes a self-contained 1-bedroom cottage, perfect for guests, rental income, or a private workspace. A borehole ensures a consistent water supply, keeping the well-maintained garden green all year round. The paved driveway and yard add to the property's clean and well-kept appearance. For added peace of mind, the property is fully walled and gated, featuring a sliding gate and armed security measures. Whether you're looking for a comfortable home or a solid investment in a prime location, this property is an excellent choice.", "Listing_ref": "PGP217944", "amenities": ["Borehole", "Air Conditioning", "Burglar Alarm", "Carport", "Electric Fence", "Electric Gate", "Fireplace", "Fitted Kitchen", "Flatlet/Cottage", "Garden", "Good ZESA", "Main En Suite", "Municipal Water", "Solar System", "Staff Quarters", "Study/Office", "Tarred Roads", "Tiled", "Verandah", "Walled", "Water Tank", "Wooden Floor"], "Company": "pam-golding", "Agent": "Nkazy Mkwananzi", "Price": "295000", "building_area": "", "land_area": "3000", "listing_url": "https://www.property.co.zw//for-sale/houses-pgp217944"}
{"Property_type": "House", "Surbub": "Selbourne Park", "City": "Bulawayo East", "Province": "Bulawayo", "bedrooms": "6", "bathrooms": "6", "Description": "Luxury home for sale in Selbourne Park in Bulawayo! This outstanding 6-bedroom, 6-bathroom residence sits on a generous plot of 1400 m² featuring top-grade finishes throughout. With a substantial building area of 520 m² - this elegant home offers ample space for a large family or guests. Each bedroom is complemented with a respective en-suite bathroom for individual comfort and privacy with the main bedroom adorned with two spacious walk-in closets. The property is graced with two beautiful and expansive lounges, perfect for family gatherings, and spills out into a splendid entertainment area in the garden.  The modern, fitted kitchen is complemented by beautiful top of the range finishes and the house also features a spacious well thought out bar/entertainment area. This home offers an exceptional living in a prime location, meticulously designed to every detail. The grand scale combined with the intimate spaces makes for a unique property waiting for you and your family to make your own. Don't miss the opportunity to view this exceptional home!", "Listing_ref": "PGP199091", "amenities": ["Borehole", "Burglar Alarm", "Carport", "Electric Fence", "Electric Gate", "Entertainment Area", "Fireplace", "Fitted Kitchen", "Garden", "Good ZESA", "Internet Connection", "Main En Suite", "Municipal Water", "Paved", "Sewer System", "Study/Office", "Tarred Roads", "Tiled", "Verandah", "Walled", "Water Tank"], "Company": "pam-golding", "Agent": "Themby Nyoni2", "Price": "295000", "building_area": "520", "land_area": "1200", "listing_url": "https://www.property.co.zw//for-sale/houses-pgp199091"}
{"Property_type": "House", "Surbub": "Sunning Hill", "City": "Bulawayo East", "Province": "Bulawayo", "bedrooms": "4", "bathrooms": "4", "Description": "Main House (Roof Level, Partially Roofed) -4 Bedrooms – All with BIC and 3 with en-suites -Sunken Lounge – With double chimney -Sun Lounge – Perfect for natural light lovers -Dining Room -Kitchen – Spacious layout with scullery -Family Bathroom & Separate Toilet Additional Features -Cottage (4-Roomed, Incomplete at Window Level) -Borehole (Unequipped) -Durawalled & Gated (Sliding Gate) -Beautifully mantained garden Finish to your taste & create your dream home!", "Listing_ref": "RANG210769", "amenities": ["Borehole", "Fireplace", "Flatlet/Cottage", "Garden", "Good ZESA", "Main En Suite", "Municipal Water", "Sewer System", "Tarred Roads", "Verandah", "Walled", "Water Tank"], "Company": "ranangaproperties", "Agent": "Takawira Nyeve", "Price": "90000", "building_area": "250", "land_area": "4000", "listing_url": "https://www.property.co.zw//for-sale/houses-rang210769"}
{"Property_type": "House", "Surbub": "Greendale", "City": "Harare East", "Province": "Harare", "bedrooms": "3", "bathrooms": "2", "Description": "Where beauty and convinience meet. House for sale in Greendale, close to Mutare Road.It abuts a cluster development meaning there's a Sewer pipeline nearby. The property is also conducive for commercial opportunities.Homestead comprises 3 bedrooms (no ensuite) 2 bathrooms both combined with toilet Lounge Dinning room, fitted kitchen 2 bedroomed income generating.  The premise also has a cottage, staff accommodation ensuring accommodation for your servants. There is also a borehole at the premise.  Carport available, let us  guide you home.", "Listing_ref": "GDW212254", "amenities": ["Borehole", "Carport", "Good ZESA", "Sewer System", "Staff Quarters", "Tiled", "Walled", "Fitted Kitchen", "Flatlet/Cottage", "Paved"], "Company": "guidewall-properties", "Agent": "Margaret Madharani", "Price": "350000", "building_area": "250", "land_area": "4054", "listing_url": "https://www.property.co.zw//for-sale/houses-gdw212254"}
{"Property_type": "House", "Surbub": "Greendale North", "City": "Harare North", "Province": "Harare", "bedrooms": "4", "bathrooms": "3", "Description": "House for Sale in Greendale Located on Harare Drive with stunning road frontage, this property offers a perfect blend of comfort, entertainment, and investment potential. *Key Features* - 3 spacious bedrooms, including a luxurious main bedroom with an en-suite bathroom - Beautiful lounge and dining area, ideal for relaxation and family gatherings - Office room for productivity and work - Fitted kitchen with pantry and scullery for efficient meal preparation - Reliable borehole with a 5,000-litre water storage tank for a steady water supply - Secure property with: - Walled premises - Paved driveway - Electric gated entrance - Entertainment areas: - Beautiful shade with a bar area - Swimming pool for recreation and leisure - Guest wing: - 1 bedroom - Kitchen - Lounge - Pantry - Bathroom - Car port accommodating two cars *Documentation* - Title Deed available *Asking Price* $450,000 Don't miss out on this fantastic opportunity! Contact us today to schedule a viewing.", "Listing_ref": "KHA218241", "amenities": ["Borehole", "Swimming Pool", "Burglar Alarm", "Carport", "Electric Gate", "Entertainment Area", "Fireplace", "Fitness Center", "Fitted Kitchen", "Flatlet/Cottage", "Garage", "Garden", "Good ZESA", "Internet Connection", "Main En Suite", "Main Road Frontage", "Municipal Water", "Parking bay", "Paved", "Staff Quarters", "Study/Office", "Tarred Roads", "Tiled", "Verandah", "Walled", "Water Tank", "Wooden Floor"], "Company": "khalida-realty", "Agent": "Simon Mbendera", "Price": "450000", "building_area": "2", "land_area": "4500", "listing_url": "https://www.property.co.zw//for-sale/houses-kha218241"}
{"Property_type": "House", "Surbub": "Sandton Park", "City": "Harare West", "Province": "Harare", "bedrooms": "4", "bathrooms": "3", "Description": "The property boasts four spacious bedrooms, with two featuring en-suite bathrooms for added convenience. The main bedroom is a true retreat, complete with a walk-in closet perfect for storing your treasured possessions. A guest wing with en-suite bathroom provides a cozy and private space for visitors. The lounge, dining, and kitchen areas are designed for comfort and entertainment. A spacious lounge offers ample space for relaxation, while a separate dining area is perfect for hosting dinner parties. The kitchen is equipped with modern appliances and a convenient pantry for food storage. A combined toilet and bathroom serves the remaining bedrooms, while a separate cottage provides additional accommodation for guests or family members. The cottage features three bedrooms, with the main bedroom boasting an en-suite bathroom. A kitchen, lounge, and combined toilet and bathroom complete the cottage's amenities. The property is equipped with a range of modern utilities, including a 5kv solar system, 5kv generator, and CCTV cameras for added security. A borehole and 5000-liter water tank ensure a reliable water supply, while two 350-liter solar geysers provide a sustainable source of hot water. A double lock-up garage provides secure parking and storage, while the property's grounds offer ample space for additional parking.", "Listing_ref": "RVL209328", "amenities": ["Borehole", "Carport", "Flatlet/Cottage", "Garage", "Garden", "Gravel Roads", "Main En Suite", "Sewer System", "Solar System", "Tiled", "Verandah", "Walled", "Water Tank"], "Company": "realtor-ville", "Agent": " Debra", "Price": "150000", "building_area": "500", "land_area": "1250", "listing_url": "https://www.property.co.zw//for-sale/houses-rvl209328"}
{"Property_type": "House", "Surbub": "Glen Lorne", "City": "Harare North", "Province": "Harare", "bedrooms": "6", "bathrooms": "4", "Description": "Split level home with 2  bedrooms  and bathroom downstairs and 2 bedrooms (MES) upstairs with a small balcony. Enter through the large dining room and you are welcomed into this charming home with a lounge, on the ground level with an extra lounge and music room leading onto entertainment area with bar and swimming pool. A small gym with sauna and jacuzzi conveniently positioned close to the swimming  pool with the added advantage of a shower and toilet for your guests to utilize. The large terraced garden lends itself to being subdivided.  There is municipal water once a week feeding two water tanks (5000 and 3000 liters) as well as a 5KVA inverter system with a solar geyser.  Staff quarters are located at the base of the garden and has  4 rooms. An attached cottage consists of 2 bedrooms, a bathroom, lounge and kitchen. 3 KVA inverter and a solar geyser. Double lock up garage plus extra car ports", "Listing_ref": "KNP190374", "amenities": ["Swimming Pool", "Burglar Alarm", "Carport", "Electric Gate", "Entertainment Area", "Fireplace", "Fitted Kitchen", "Flatlet/Cottage", "Garage", "Garden", "Main En Suite", "Municipal Water", "Paved", "Solar System", "Split Level", "Staff Quarters", "Study/Office", "Tiled", "Verandah", "Walled", "Water Tank"], "Company": "kennan-properties", "Agent": "Julie Denton", "Price": "550000", "building_area": "", "land_area": "5551", "listing_url": "https://www.property.co.zw//for-sale/houses-knp204380"}
{"Property_type": "House", "Surbub": "Mt Pleasant Heights", "City": "Harare West", "Province": "Harare", "bedrooms": "5", "bathrooms": "2", "Description": "NULL", "Listing_ref": "PGP216531", "amenities": ["Borehole", "Carport", "Fitted Kitchen", "Garage", "Main En Suite", "Tiled", "Walled", "Water Tank"], "Company": "pam-golding", "Agent": "Kuda Makawa", "Price": "280000", "building_area": "500", "land_area": "2000", "listing_url": "https://www.property.co.zw//for-sale/houses-pgp216531"}
