{"Property_type": "House", "Surbub": "Greendale", "City": "Harare East", "Province": "Harare", "bedrooms": "2", "bathrooms": "2", "Description": "**ON SHOW TUESDAY 29 APRIL 12:00 PM - 2:00 PM** Discover your ideal home or your next rental investment opportunity in this stunning and modern 2-bedroom, 2-bathroom cluster house. Featuring a spacious double-volume, open-plan living area and contemporary finishes throughout with a separate guest toilet for added convenience. This home is designed for both comfort and functionality! Key Features: - 163 sqm Floor Area on a 503 sqm Land Area (Total land area 6870 sqm) - Fitted Gas Stove in a modern kitchen with sleek finishes. - Ensuite bathrooms in both bedrooms. - Side entrance to separate scullery with inverter (BYOB) - 40,000-litre water storage tanks for the complex (20,000L for Borehole water & 20,000L for CoH) - 2 x Complex / Communal Boreholes (Water Flow Rates: 350 litres per hour & 400 litres per hour) - Separate CoH individual rates meters per unit. - Private Garden with veranda for peaceful, outdoor space. - Each unit is fully walled for privacy and security. - Estimated completion date set as end of June - 11 x Units Total in Complex This home offers a perfect blend of style, practicality and charm. LAST 2 UNITS AVAILABLE - Don't miss out on this exceptional opportunity! Contact Ty for more details and to schedule a viewing.", "Listing_ref": "Listing ref: PRL215698", "amenities": ["Borehole", "Carport", "Electric Gate", "Fitted Kitchen", "Garden", "Internet Connection", "Main En Suite", "Municipal Water", "Parking bay", "Paved", "Solar System", "Tiled", "Verandah", "Walled", "Water Tank"], "Company": "/estate-agents/property-link", "Agent": "Ty Kenee", "Price": "USD 220,000 ", "building_area": "163 m²", "land_area": "503 m²", "listing_url": "https://www.property.co.zw//for-sale/townhouses-prl215698"}
{"Property_type": "House", "Surbub": "Greendale", "City": "Harare East", "Province": "Harare", "bedrooms": "7", "bathrooms": "NULL", "Description": "On offer are 20 luxurious duplex townhouses in Greendale. The units are now selling off plan and have a completion date of June 2025. The building area of each of these units is 326m². The ground floor consists of an open plan kitchen, dining and lounge. It boosts with a guest room with own ensuite plus a maid's quarters with own entrance. The first floor houses 5 bedrooms including the master bedroom with an ensuite. The second bedroom also comes with an ensuite with the other 3 bedrooms sharing a communal bathroom and toilet. Depending on one's choice of preference, some of the bedrooms can either be converted into a 2nd lounge, study or gym. The gated complex comes good security and parking bays. It has the following amenities; community borehole including water tanks, municipal water, electricity (Zesa), solar systems, garden and a playground. A 50% deposit is accepted plus the balance of 50% payable in 12 months. For the first 6 months no interest is charged then after a 2% interest is charged on the balance.", "Listing_ref": "Listing ref: GAT207507", "amenities": ["NULL"], "Company": "/estate-agents/guest-and-tanner", "Agent": "George Nzunga", "Price": "USD 280,000 ", "building_area": "326 m²", "land_area": "", "listing_url": "https://www.property.co.zw//for-sale/townhouses-gat207507"}
{"Property_type": "House", "Surbub": "Westlea", "City": "Harare West", "Province": "Harare", "bedrooms": "4", "bathrooms": "5", "Description": "Westlea Immaculate House For Sale Sitting on 1000Sqm Developer Cession Ground Floor Double Lock Up Garage Commodious Lounge Open Plan Kitchen and Dining kitchen with fine Linen cupboards Scullery  and granite tops Bed 1 with dressing area Toilet with pedestal washing Basin Bed2 ensuite with   Corner tub and BICs 1St Floor Stairs with Morden Metal stair Railing and Balusters Private Lounge with a Bar area with linen cupboards and neat ceiling Big Private Balcony Main Bedroom with Private Dressing Area Ensuite with cabinate WC,Cnr Bathtub Interleading Sunny Bedroom ensuite with a Corner Bathtub Paved Landscape 5000ltr water tank Cottage 3 Beds Spacious Lounge Storeroom Combined Toilet and Bathroom Kitchen with cupboards MainBedroom Ensuite with Shower Cubicle and pedestal sink and wall tiles Roof With Fisca boards Double concrete Basin Sink Braii Area Electric fence Gyser Tank with pressure pump Carpot Fowl Run", "Listing_ref": "Listing ref: KHA193364", "amenities": ["Borehole", "Electric Gate", "Entertainment Area", "Fireplace", "Fitted Kitchen", "Flatlet/Cottage", "Gravel Roads", "Internet Connection", "Main En Suite", "Paved", "Sewer System", "Solar System", "Study/Office", "Tarred Roads", "Tiled", "Verandah", "Walled", "Water Tank"], "Company": "/estate-agents/khalida-realty", "Agent": "Simon Mbendera", "Price": "USD 150,000 ", "building_area": "600 m²", "land_area": "1,000 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-kha193364"}
{"Property_type": "House", "Surbub": "Northwood", "City": "Harare North", "Province": "Harare", "bedrooms": "4", "bathrooms": "3", "Description": "Nestled in the heart of Northwood, this charming and spacious home offers the perfect blend of comfort and convenience in a peaceful neighborhood. Set on a generous set of land, this property provides ample space for family living and outdoor enjoyment. The home boasts four well appointed bedrooms, including a master ensuite for added privacy. The home features two inviting lounges, a guest toilet fitted kitchen and a well appointed layout with a separate toilet , bathroom and an additional shower room ensuring comfort for the entire family. For added versatility, the property includes a self contained two bedroom cottage, ideal for rental income, guests, or extended family. Additionally there is a double staff quarters providing extra accommodation. Outdoor enthusiasts will appreciate the lush garden with a greenhouse perfect for home grown produce. A reliable borehole ensures an uninterrupted water supply, and the expansive yard offers plenty of space for relaxation for further development. Located in a quiet secure neighborhood, this home is the ideal sanctuary for those seeking space , tranquility and modern convenience.", "Listing_ref": "Listing ref: PGP213880", "amenities": ["Borehole", "Carport", "Electric Fence", "Electric Gate", "Fireplace", "Fitted Kitchen", "Flatlet/Cottage", "Garage", "Garden", "Good ZESA", "Internet Connection", "Main En Suite", "Municipal Water", "Sewer System", "Solar System", "Staff Quarters", "Study/Office", "Tarred Roads", "Verandah", "Walled", "Water Tank", "Wooden Floor"], "Company": "/estate-agents/pam-golding", "Agent": "cecil Kachambwa", "Price": "USD 430,000 ", "building_area": "350 m²", "land_area": "4,611 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-pgp213880"}
{"Property_type": "House", "Surbub": "Richmond", "City": "Bulawayo North", "Province": "Bulawayo", "bedrooms": "2", "bathrooms": "NULL", "Description": "NULL", "Listing_ref": "Listing ref: JSPP214019", "amenities": ["NULL"], "Company": "/estate-agents/just-property", "Agent": "Yevai Makoni", "Price": "USD 70,000 ", "building_area": "550 m²", "land_area": "4,000 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-jspp214019"}
{"Property_type": "House", "Surbub": "Sandton Park", "City": "Harare West", "Province": "Harare", "bedrooms": "5", "bathrooms": "3", "Description": "Welcome to Sandton Phase 1, a luxurious 5-bedroom haven that embodies the ultimate living experience. Nestled in a serene setting, this magnificent property boasts a lavish master suite oasis, complete with a walk-in closet, rejuvenating Jacuzzi, and refreshing shower, all within an expansive 6x7 floor plan. The entertainment haven features two stylish lounges perfect for socializing and relaxation, while the gourmet kitchen and dining area are ideal for culinary masterpieces. The outdoor space is just as impressive, with a charming gazebo and sparkling swimming pool creating an idyllic setting. A 1-bedroomed cottage for guests or staff adds to the property's allure, while a reliable borehole, tank, and cutting-edge 10kv Solar System ensure sustainable luxury. Asking price: $155k", "Listing_ref": "Listing ref: APGP214824", "amenities": ["Borehole", "Swimming Pool", "Burglar Alarm", "Carport", "Electric Gate", "Entertainment Area"], "Company": "/estate-agents/apex-property-group", "Agent": "Fanny Mwanza", "Price": "USD 155,000 ", "building_area": "350 m²", "land_area": "2,000 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-apgp214824"}
{"Property_type": "House", "Surbub": "Burnside", "City": "Bulawayo East", "Province": "Bulawayo", "bedrooms": "4", "bathrooms": "2", "Description": "Modern house with this recently built 4 bedrooms, gem in burnside, the masterpiece featuring a walk - in closet for both him and her, a stylish ensuite bathroom with a classy tub, shower, and dual ceramic sinks, the open -plan kitchen is an entertainer \"s dream, boasting center island, fitted gas and electric stove, a fridge and an oven. Relax in any of the three lounges including a sunken lounge and a dedicated games lounge. The home is equipped with a guest toilet, a common bathroom with both a tub and shower a laundry room, and a double lock up garage Outside, a gazebo with a bar overlooks a fully functional swimming pool, while the prolific borehole and 10 solar panels power the home, including two solar geysers Also including is a stunning modern cottage currently operating as Airbnb, offering 3 bedrooms with a master ensuite featuring modern wardrobes and a USB romantic mirror. The fitted kitchen comes with both gas and electric comes with both gas and electric stoves. A solar geyser and 15 solar panels ensure energy efficiency. The domestic quarters ,80% complete, offer 2 bedrooms under IBR, a kitchen, lounge, and combined toilet and Tub. Set on 4000 sqm, this property is fully walled and gated. It's a dream home at $, 230 000. this property is solar powered and self-sustaining with borehole water", "Listing_ref": "Listing ref: PGP205852", "amenities": ["Borehole", "Swimming Pool", "Entertainment Area", "Fitted Kitchen", "Main En Suite", "Paved", "Solar System", "Tiled", "Verandah", "Walled", "Water Tank"], "Company": "/estate-agents/pam-golding", "Agent": "Melody Phakathi", "Price": "USD 205,000 ", "building_area": "", "land_area": "4,000 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-pgp205852"}
{"Property_type": "House", "Surbub": "Chisipite", "City": "Harare North", "Province": "Harare", "bedrooms": "4", "bathrooms": "3", "Description": "This exquisite 4-bedroom residence offers the perfect blend of luxury and comfort, making it ideal for both commercial and residential use. Situated in the prestigious Chisipite neighborhood, this property boasts: Elegant Living Spaces: Enjoy spacious bedrooms with built-in cupboards and plush carpeting. The main bedroom features a private ensuite bathroom for ultimate convenience. A separate bathroom and toilet serve the remaining bedrooms. The modern kitchen, adorned with ceramic flooring and tiled walls, is a chef's dream. Outdoor Oasis: Relax and entertain in the beautifully landscaped garden, complete with a refreshing swimming pool and a full-sized tennis court. The double lock-up garage provides secure parking for your vehicles. Additional Features: The property also includes self-contained staff quarters for added convenience. Don't miss this opportunity to own a truly exceptional property. Schedule a viewing today!", "Listing_ref": "Listing ref: SEF204591", "amenities": ["Borehole", "Swimming Pool", "Burglar Alarm", "Carport", "Electric Fence", "Electric Gate", "Entertainment Area", "Fireplace", "Fitted Kitchen", "Flatlet/Cottage", "Garage", "Garden", "Good ZESA", "Main En Suite", "Parking bay", "Paved", "Tarred Roads", "Tennis Court", "Tiled", "Walled", "Water Tank"], "Company": "/estate-agents/seeff", "Agent": "Sindi Mangiza", "Price": "USD 580,000 ", "building_area": "300 m²", "land_area": "4,047 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-sef204591"}
{"Property_type": "House", "Surbub": "Granary Park", "City": "Harare High Density", "Province": "Harare", "bedrooms": "4", "bathrooms": "NULL", "Description": "FOR SALE Royal Properties presents Granary 4 bed house mes, dinning, lounge,kitchen, roofed no ceiling, single garage, not walled. Sitting on 324sqm Developer Cession Asking price 50k Jones", "Listing_ref": "Listing ref: RPT195735", "amenities": ["NULL"], "Company": "/estate-agents/royal-properties", "Agent": "Nigel Jones", "Price": "USD 50,000 ", "building_area": "200 m²", "land_area": "324 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-rpt195735"}
{"Property_type": "House", "Surbub": "Chisipite", "City": "Harare North", "Province": "Harare", "bedrooms": "4", "bathrooms": "NULL", "Description": "Located in the serene neighbourhood of Chisipite, this charming 4-bedroom house exudes a warm and inviting atmosphere. While retaining its classic allure, the home offers spacious bedrooms and a cosy living area, perfect for family gatherings. The kitchen and bathrooms are functional and maintain a vintage charm. The highlight of this property is its enchanting garden, offering a peaceful retreat with mature trees and vibrant blooms. A private tennis court and swimming pool add to the appeal, providing a perfect spot for leisurely play. It has a double lock up garage and ample parking space. This property is ideal for those seeking a blend of nostalgia and tranquillity. Contact Sima to book a viewing", "Listing_ref": "Listing ref: GAT214517", "amenities": ["Swimming Pool", "Fitted Kitchen", "Good ZESA", "Garden", "Garage", "Tarred Roads", "Tiled"], "Company": "/estate-agents/guest-and-tanner", "Agent": "Sima ", "Price": "USD 650,000 ", "building_area": "", "land_area": "4,000 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-gat214517"}
{"Property_type": "House", "Surbub": "Gletwin Park", "City": "Harare North", "Province": "Harare", "bedrooms": "7", "bathrooms": "NULL", "Description": "Guest and Tanner is proud to present this expansive  7 bedrooms and 7 ensuites bathrooms  double storey in Gletwin. The property sits on 3629sqm with ample space for expansion or gardening. The house is very close to Enterprise Road and along a tarred road. Downstairs, features a modern kitchen with granite countertops, pantry, separate scullery and laundry room, spacious dining, very generous lounge, guest bedroom with an ensuite, toilet and bath, double lock up garage which fit 4 cars plus a storeroom. Upstairs, features 6 bedrooms, second lounge with provision for a kitchenette, prayer room, study room, maid room, large balcony. The main bedroom has a dressing room, jacuzzi bath and a spa shower in it's ensuite bathroom and an attached  office. The property is serviced by a prolific borehole with a 5000 litre  water tank. There is a 6.2kva solar system. Outbuildings , include a 3 bedroomed, main ensuite , kitchen and dining which is being rented out. It also have a separate 3kva solar plus it's own electricity meter. The property is walled and gated with electric fence and sliding gate with CCTV and a guard room. The property has internal and external sensors. Ownership is through Developers cession.", "Listing_ref": "Listing ref: GAT216801", "amenities": ["Borehole", "Double Storey", "Electric Fence", "Electric Gate", "Fitted Kitchen", "Flatlet/Cottage", "Garage", "Garden", "Good ZESA", "Main En Suite", "Paved", "Solar System", "Tarred Roads", "Tiled", "Walled", "Water Tank"], "Company": "/estate-agents/guest-and-tanner", "Agent": "Morgan Machikiti", "Price": "USD 530,000 ", "building_area": "", "land_area": "3,629 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-gat216801"}
{"Property_type": "House", "Surbub": "Glen View", "City": "Harare High Density", "Province": "Harare", "bedrooms": "4", "bathrooms": "2", "Description": "NULL", "Listing_ref": "Listing ref: THRE212274", "amenities": ["NULL"], "Company": "/estate-agents/tripple-horizon-real-estate", "Agent": "Eddson Tafa", "Price": "USD 24,000 ", "building_area": "100 m²", "land_area": "230 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-thre212274"}
{"Property_type": "House", "Surbub": "Mandara", "City": "Harare East", "Province": "Harare", "bedrooms": "3", "bathrooms": "3", "Description": "A well loved solid family home set in an established garden. House- Entrance hall into sunken lounge leading onto veranda overlooking garden and separate dining room.  Dated fitted kitchen.  3 bedrooms, 2 bathrooms and study nook. Cottage - 1 bedroom living room kitchenette and bathroom with a solar geyser and its own private entertaining area. Good Borehole.  Entertainment/Braai  area.  Security lights and garden lights. 5KVA solar system and 12 panels. Solar geysers, storeroom and car port.   Double lock up garage.  Staff accommodation with 1000 litre water tank.  Fully walled and electric gate.", "Listing_ref": "Listing ref: KNP216292", "amenities": ["Borehole", "Carport", "Electric Gate", "Entertainment Area", "Fireplace", "Fitted Kitchen", "Flatlet/Cottage", "Garage", "Garden", "Main En Suite", "Solar System", "Staff Quarters", "Verandah", "Walled", "Water Tank"], "Company": "/estate-agents/kennan-properties", "Agent": "Brenda Cohen", "Price": "USD 325,000 ", "building_area": "", "land_area": "4,309 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-knp216292"}
{"Property_type": "House", "Surbub": "Waterfalls", "City": "Harare South", "Province": "Harare", "bedrooms": "4", "bathrooms": "2", "Description": "Waterfalls, picnic park ( Roof Incomplete house for sale $52k ) -4 bedroomed with main bedroom ensuite -2 bathrooms -Indoor garage -500sqm stand size -Serviced area [ Electricity and water available ] -Council cession Important Details: – Incomplete Build: The house is not plastered, no ceiling installed, roofed, and tiles are yet to be laid. – Plumbing Required: Customize the plumbing to suit your lifestyle. – Utilities: – Water is connected, ensuring a ready supply. – Durawalled for security and privacy. – Well for additional water resource. – Electricity is available (currently not functioning). – Telone line available for internet and communication needs.", "Listing_ref": "Listing ref: GAT218219", "amenities": ["Garage", "Municipal Water"], "Company": "/estate-agents/guest-and-tanner", "Agent": "Simbarashe Hove", "Price": "USD 52,000 ", "building_area": "", "land_area": "500 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-gat218219"}
{"Property_type": "House", "Surbub": "Greendale", "City": "Harare East", "Province": "Harare", "bedrooms": "4", "bathrooms": "2", "Description": "Pam Golding properties is proud to offer this opportunity to a discerning Buyer to invest in this incomplete but habitable home with loads of potential. The property consists of a single storey residential dwelling that has been re-modelled sitting on approximately 4800 sqm . The house is brick under chromadek offering 4 bedrooms with a main ensuite and walk in closet provision, separate family bathroom and toilet, an incomplete lounge, a dining room, fitted kitchen. Pending are floor, windows, doors, ceiling works on the other wing of the house, as well as cabinetry. The whole house would need skimming and painting both in and out. There is a double-staff quarters. A productive  borehole and a 5000l water reserve tank on a  steel framed stand service the well maintained garden and the water needs in the house. The property is walled on all sides and is gated. USD Nostro welcome.", "Listing_ref": "Listing ref: PGP214820", "amenities": ["Borehole", "Fitted Kitchen", "Garage", "Garden", "Good ZESA", "Main En Suite", "Paved", "Staff Quarters", "Verandah", "Walled", "Water Tank"], "Company": "/estate-agents/pam-golding", "Agent": "Tawanda Musevenzo", "Price": "USD 350,000 ", "building_area": "400 m²", "land_area": "4,800 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-pgp214820"}
{"Property_type": "House", "Surbub": "Glen Lorne", "City": "Harare North", "Province": "Harare", "bedrooms": "6", "bathrooms": "6", "Description": "This grand, incomplete structure is situated on over 8200m2 of prime land just off the prestigious Folyjohn Crescent in Glen Lorne, Harare. With a multi level design and breathtaking valley views, this property offers an unparalleled opportunity to create a customized luxury home. Features: Ground Floor Grandeur: - Double-Height Entrance Hall: A grand entrance leading to a double-floor lounge. - Study & Reading Room: The study includes a private bathroom, while the reading room offers a quiet retreat. - Double Lock-Up Garages: Conveniently positioned on either side of the entrance. - Kitchen & Dining Area: Includes a lockable pantry, scullery, and family lounge/kitchen extension, with a dining room offering stunning valley views. - Guest Bedroom: Equipped with an enlarged door for wheelchair access. Top-Floor Luxury: -Three Bedrooms: The main bedroom has a double ensuite (his and hers), and the two additional bedrooms feature en suite bathrooms and dressing areas. - Wake up to sweeping views of the valley. First Basement Retreat/Entertainment area: - Valley Views: The basement, not visible from the street, enjoys beautiful valley views. - Two Bedrooms: Both bedrooms come with en suite bathrooms/dressing areas. - Entertainment Space: A bar area overlooks a large lounge, and the wellness area includes a gym, toilet, and sauna. - Lift or Spiral Staircase Provision: A space is reserved for either a spiral staircase or a small domestic lift connecting to the upper floors. - Visitor Access: A double door side entrance will allow visitors to access the lounge area without needing to pass through the main house. Second Basement Functionality: - Domestic Quarters: Includes two bedrooms, a toilet, shower, and kitchen for staff accommodation. - External Access: The domestic quarters connect to the main house via an external stairway that leads to the kitchen door. - Engine Room: A large engine room designed to house water pumps and filters for efficient operation of the home. Third Basement Water Management: - Massive Water Storage Facility: This steel and concrete waterproofed structure has the capacity to store liters of rainwater collected from the roof via in-built pipes. It also has the facility to accept water deliveries straight into the tank. O Piping Infrastructure: The house is equipped with piping to supply filtered water from the tank, ensuring a reliable water system. Expansive Plot: -The 8,200+ square meter plot provides ample space for landscaped gardens, outdoor entertainment areas, and other luxury amenities. - Infinity Pool: The land has been pegged for the construction of an infinity pool, accessible from the first basement lounge. Eco-Friendly Roof & Energy Storage: -The concrete roof is designed to carry over 100 solar panels, providing ample energy potential for the entire home. - A dedicated battery room is capable of storing a large number of lithium-ion batteries if required, ensuring consistent energy storage and us", "Listing_ref": "Listing ref: PGP197550", "amenities": ["Borehole", "Carport", "Double Storey", "Entertainment Area", "Fireplace", "Garage", "Garden", "Main En Suite", "Parking bay", "Split Level", "Staff Quarters", "Study/Office", "Verandah", "Water Tank", "Workshop"], "Company": "/estate-agents/pam-golding", "Agent": "Rory Levey", "Price": "USD 900,000 ", "building_area": "900 m²", "land_area": "8,200 m²", "listing_url": "https://www.property.co.zw//for-sale/houses-pgp197550"}
