{"Listing_ref": "Listing ref: MBE167836", "Company": "/estate-agents/terestrial-investments", "Agent": "Charlin. ", "Price": "USD 72,000 ", "Surbub": " Rainham", "City": " Harare West", "Province": " Harare", "bedrooms": "3", "bathrooms": "", "building_area": "", "land_area": "249.7 m²", "Description": "HOUSE TYPE MODEL 3Single Story Ready for occupation Land Size\t\t249.66m² Floor Area\t\t105 sqm² Three-bedroomed  furnished house with main bedroom en-suite, separate bath and toilet for visitors.  Open plan kitchen with fitted cabinets with an open plan dining & lounge linked to a large veranda.  Open space suitable to park 2 cars with a braai area at the backyard. Payment terms 50% deposit balance in 6months", "amenities": ["Carport", "Main En Suite", "Tiled", "Verandah", "Walled", null]}
{"Listing_ref": "Listing ref: GLRE218372", "Company": "/estate-agents/golden-will", "Agent": "Gugulethu Ncube", "Price": "USD 4,500 ", "Surbub": " Borrowdale", "City": " Harare North", "Province": " Harare", "bedrooms": "4", "bathrooms": "4", "building_area": "", "land_area": "4,000 m²", "Description": "BORROWDALE TO RENT! Location: Borrowdale, Harare For Rent: $4,500 per month Features: 4 spacious bedrooms 2 en-suite bathrooms 2 spacious bedrooms with 1 common bathroom 1 guest toilet Modern fitted kitchen Dining and lounge area Office/study Double open garage Staff quarters Walled and gated for security Sparkling swimming pool Beautiful garden Laundry room 4000sqm stand Title Deeds available Private sale Don't miss out on this incredible opportunity! Contact us to schedule a viewing.", "amenities": ["Borehole", "Swimming Pool", "Double Storey", "Main En Suite", "Walled", "Water Tank", null]}
{"Listing_ref": "Listing ref: HVN216444", "Company": "/estate-agents/heaven-on-earth", "Agent": "Mr Mubaiwa", "Price": "USD 375,000 ", "Surbub": " Marlborough", "City": " Harare West", "Province": " Harare", "bedrooms": "3", "bathrooms": "2", "building_area": "", "land_area": "4,275 m²", "Description": "", "amenities": ["Borehole", "Entertainment Area", "Fireplace", "Fitted Kitchen", "Flatlet/Cottage", "Garden", "Good ZESA", "Main En Suite", "Municipal Water", "Parking bay", "Paved", "Staff Quarters", "Tiled", "Verandah", "Walled", "Water Tank", null]}
{"Listing_ref": "Listing ref: CAC213020", "Company": "/estate-agents/carson-and-carson", "Agent": "Rewai Hamadziripi", "Price": "USD 300,000 ", "Surbub": " Mt Pleasant Heights", "City": " Harare West", "Province": " Harare", "bedrooms": "6", "bathrooms": "8", "building_area": "", "land_area": "2,240 m²", "Description": "Finish to your own liking this massive double storey home offering the following: Ground Floor • Spacious kitchen (needs fittings) • dining room • 3 lounges • 3 bedrooms, all ensuite • self contained guest wing with a kitchenette • guest bathroom/toilet Upstairs • lounge • study • gym • 4 beds, all ensuite • common bathroom/toilet Extras • borehole • triple lockup garage • staff quarters • brick walled and gated All on 2000sqm, Developer Cession", "amenities": ["Borehole", null]}
{"Listing_ref": "Listing ref: t7216206", "Company": "javascript:;", "Agent": null, "Price": "USD 150,000 ", "Surbub": " Hogerty Hill", "City": " Harare North", "Province": " Harare", "bedrooms": "6", "bathrooms": "2", "building_area": "", "land_area": "2,300 m²", "Description": "Stunning Family Home with Modern Amenities Welcome to your dream property! This spacious and beautifully designed home on 2300sqm offers everything you need for comfortable living and entertaining. Key Features: Garage & Storage: Secure parking for two cars with direct access to a convenient storeroom. Laundry Facilities: A dedicated laundry area to make household chores a breeze. Open Living Space: Enjoy a huge open-plan lounge, dining area, and kitchen, perfect for family gatherings and social events. Pantry: Ample storage for all your culinary needs. Outdoor Living: Expansive Verandah: A massive verandah wraps around the front of the house, providing a perfect spot to relax and enjoy the views. Gardens: A large backyard ideal for growing vegetables, complemented by a spacious front yard that’s perfect for gatherings and parking. Bedrooms: 6 Bedrooms: Generously sized with the main bedroom featuring an en-suite and built-in wardrobes for maximum storage. Additional Bathrooms: A second bathroom and separate toilet for guests ensure everyone's comfort. Energy Efficiency: WiFi Connectivity: Stay connected with reliable internet throughout the home. Powerful Solar System: Operates 24/7, powering all your appliances, including fridges, lights, and more. Enjoy the benefits of sustainable living with a backup electricity system. Water Supply: A 75-meter borehole pumps water into a 5000-litre tank, ensuring you never run out of water. Security Features: Burglar Bars: Installed throughout the property for added safety. Gated Entrance: Walled and gated entry with a guard room for peace of mind. Additional Information: Main Bedroom Entrances: Features two entrances with elegant French doors (4m and 2m), enhancing accessibility and style. Lounge Entrances: Two expansive French doors (4m each) provide a seamless flow between indoor and outdoor spaces. This property combines comfort, security, and sustainability, making it the perfect family home. Don't miss the opportunity to make it yours! Contact us today for a viewing.", "amenities": ["Carport", "Garage", "Good ZESA", "Internet Connection", null]}
{"Listing_ref": "Listing ref: PGP215971", "Company": "/estate-agents/pam-golding", "Agent": "Melody Phakathi", "Price": "USD 155,000 ", "Surbub": " Ilanda", "City": " Bulawayo East", "Province": " Bulawayo", "bedrooms": "4", "bathrooms": "2", "building_area": "", "land_area": "", "Description": "This spacious 4-bedroom family home is located on a desirable corner stand, offering extra privacy and more outdoor space. The home features a main bedroom with an ensuite, and all bedrooms are equipped with built-in wardrobes for ample storage. The cozy lounge, complete with a fireplace, is perfect for relaxing, and there is a common bathroom and toilet for convenience. The kitchen is well-fitted with cupboards and a hood fan, making meal preparation easy and efficient. The dining room opens up to a beautiful garden, a paved outdoor area, and a refreshing swimming pool, providing a great setting for relaxation and entertaining. The property also includes a 3-room cottage, ideal for guests or as a rental unit. Additional features include a Jojo tank for water storage, an electric fence for enhanced security, and a gate for privacy. The corner stand, measuring 1719 sqm, offers plenty of space for your family to enjoy. With an asking price of $170,000 USD (negotiable, with expectations of around $150,000 USD,) this property is a great opportunity to own a home that combines comfort, security, and plenty of potential.", "amenities": ["Swimming Pool", "Electric Fence", "Electric Gate", "Fireplace", "Garage", "Garden", "Good ZESA", "Main En Suite", "Paved", "Staff Quarters", "Tarred Roads", "Verandah", "Walled", "Water Tank", "Wooden Floor", null]}
{"Listing_ref": "Listing ref: PGP216951", "Company": "/estate-agents/pam-golding", "Agent": "Malini Patel", "Price": "USD 550,000 ", "Surbub": " Belgravia", "City": " Harare North", "Province": " Harare", "bedrooms": "3", "bathrooms": "1", "building_area": "", "land_area": "3,688 m²", "Description": "Ideally Located Property in the Commercial part of Belgravia. Welcome to a unique opportunity in a highly sought-after area! This ideally situated property boasts a prime location that offers the best of both worlds - Convenience and Potential. Currently featuring a tear-down house, this site presents a blank canvas for your vision, whether you’re looking to develop a residential oasis or a thriving commercial space. Key Features: - Prime Location: Nestled in a vibrant neighborhood of Belgravia, this property is perfectly positioned for both residential and commercial development. - Versatile Zoning: The property is in a zone for mixed-use, allowing for a variety of possibilities, from single-family homes to multi-family units or commercial enterprises. - Development Potential: With ample square metreage and a spacious lot, the possibilities are endless. Imagine building your dream home, a boutique shop, or a cozy café/restaurant that takes advantage of the bustling community atmosphere. - Community Amenities: Just minutes away from parks, schools, shopping, and dining, this location offers the convenience and lifestyle that attracts residents and businesses alike. - Investment Opportunity: Whether you’re a Developer looking for your next project or an Investor seeking a property with significant upside potential, this site is a rare find. -Total land size 3688 sqm. Good ZESA and Municipal Water Don’t miss out on the chance to transform this property into something extraordinary. Schedule a viewing with Malini today and explore the endless possibilities!", "amenities": [null]}
{"Listing_ref": "Listing ref: GAT209856", "Company": "/estate-agents/guest-and-tanner", "Agent": "Brian Mudzukwa", "Price": "USD 330,000 ", "Surbub": " Murambi", "City": " Mutare", "Province": " Manicaland", "bedrooms": "4", "bathrooms": "2", "building_area": "", "land_area": "5,700 m²", "Description": "A rare opportunity to own an amazing property in the affluent suburb of Murambi.The property sits on a piece of land measuring 5700m², comprising 4 bedrooms( main ensuite) ,fitted kitchen, dining, lounge with fireplace, separate toilet,separate bath, separate laundry room, veranda, tiled, ceiling. Part double storey with bar downstairs. It’s walled and gated. Swimming pool. Clean title deed. Call/WhatsApp to book for viewing Asking price 330k", "amenities": [null]}
{"Listing_ref": "Listing ref: SBRE216113", "Company": "/estate-agents/stonebridge-real-estate", "Agent": "Beatrice ", "Price": "USD 120,000 ", "Surbub": " Malindela", "City": " Bulawayo South", "Province": " Bulawayo", "bedrooms": "3", "bathrooms": "1", "building_area": "", "land_area": "~", "Description": "This delightful property features: - Garage with additional storage space - Cozy cottage with: • Lounge area for relaxation • Dining room for family meals • Office/study for work or hobbies • Kitchen for easy meal prep • Family bathroom • Separate toilet - 3 bedrooms, including: • Main bedroom with en-suite bathroom • Built-in cupboards (BIC) for ample storage Security Features: - Walled and gated property for added security and peace of mind A perfect haven for a small family, couple, or individual seeking a low-maintenance and charming living space!\"", "amenities": ["Fitted Kitchen", "Flatlet/Cottage", "Garage", "Garden", "Good ZESA", "Parking bay", "Paved", "Sewer System", "Tiled", "Walled", "Water Tank", null]}
{"Listing_ref": "Listing ref: GAT217273", "Company": "/estate-agents/guest-and-tanner", "Agent": "Herbert Moyo", "Price": "USD 320,000 ", "Surbub": " Marlborough", "City": " Harare West", "Province": " Harare", "bedrooms": "3", "bathrooms": "", "building_area": "", "land_area": "4,000 m²", "Description": "", "amenities": [null]}
{"Listing_ref": "Listing ref: PRL216517", "Company": "/estate-agents/property-link", "Agent": "Immi Abdul-Karim", "Price": "USD 210,000 ", "Surbub": " Avondale West", "City": " Harare West", "Province": " Harare", "bedrooms": "3", "bathrooms": "3", "building_area": "", "land_area": "4,575 m²", "Description": "Recently built complex of total 9 units, Offers a blend of comfort and convenience. This unit offers 3 spacious bedrooms (Main ensuite) with built-in-cupboards, an open-plan kitchen, lounge / dining area, full separate bathroom and a guest toilet. Other Key Features include: - Solar inverter 5000kva - 2000-litre water tank - Borehole water supply - Electric gate/ fencing. - 2 x Carports - Visitors' parking. - Sectional title available The complex is situated in close proximity to the CBD, medical facilities and shopping centres. This townhouse offers a modern living experience in a sought-after location. Contact Immi to set up a viewing by appointment", "amenities": ["Borehole", "Carport", "Electric Fence", "Electric Gate", "Fitted Kitchen", "Garden", "Internet Connection", "Main En Suite", "Solar System", "Tiled", "Walled", "Water Tank", null]}
{"Listing_ref": "Listing ref: KHA211923", "Company": "/estate-agents/khalida-realty", "Agent": "Milton Chitakatira", "Price": "USD 255,000 ", "Surbub": " Arlington", "City": " Harare South", "Province": " Harare", "bedrooms": "4", "bathrooms": "3", "building_area": "", "land_area": "558 m²", "Description": "Arlington East Luxury Home Location: - Situated in the highly sought-after neighborhood of Arlington East Property Details: - 558sqm property with deeds available - Price: US$255k Accommodation: - 4 spacious bedrooms, each with built-in cupboards for ample storage - Main bedroom en-suite with: - Walk-in closet for convenient storage - Corner bathtub for relaxation - Cabinet washing basin with porcelain wall tiles - Shower cubicle with fixed and awning window for natural ambiance Garage and Parking: - Double lock-up garage with secure parking for two vehicles Living Areas: - Formal lounge with: - Modern TV unit for entertainment - Open-plan design flowing into the kitchen - Kitchen: - Top-notch finishes with granite countertops - Separate scullery for convenient meal preparation Bathroom: - Combined bathroom and toilet with: - Glazed wall tiles for an exceptional aesthetic appeal - Corner bathtub for relaxation - Free-standing and ceramic washing basin Outdoor and Additional Features: - Lush and verdant garden perfect for outdoor relaxation - Neat swimming pool for refreshing dips - CCTV system for added security - 10Kv solar system for sustainable energy - 5000ltr tank and 2000ltr tank for water storage - Prolific borehole for a reliable water supply - Wall-mounted lights for ambient lighting - Electric gate for secure entrance - Single concrete basin for added convenience Security and Privacy: - Walled and gated property for added security and privacy", "amenities": ["Borehole", "Air Conditioning", "Electric Gate", "Entertainment Area", "Fitted Kitchen", "Garage", "Garden", "Good ZESA", "Internet Connection", "Main En Suite", "Paved", "Sewer System", "Solar System", "Study/Office", "Tarred Roads", "Tiled", "Verandah", "Walled", "Water Tank", null]}
{"Listing_ref": "Listing ref: GRM216123", "Company": "/estate-agents/graham-douglas", "Agent": "Bismark Maposa", "Price": "USD 460,000 ", "Surbub": " The Grange", "City": " Harare North", "Province": " Harare", "bedrooms": "7", "bathrooms": "", "building_area": "", "land_area": "2,000 m²", "Description": "Structure sitting area: 440sqm Stand size: 2000sqm Cosy 7 bedroom double storey home in Harare north boasts of it being in a school district and a luxurious life-style area. It is close to one-stop shopping malls and a low density secure geography. This home comprises:- Downstairs - 4 bedrooms all ensuites,  a big lounge, a 12 perfect sitter dining room, kitchen, pantry, scullery and, a double lock-up garage. Upstairs - an entertainment lounge, barbecue area, kitchenette, general bathroom, 2 bedroom ensuite and a spacious master ensuite with a walk-in dressing area for his and hers and a balcony. Extras: - prolific borehole with clean water. - fence and gate secured with neighbourhood security. Property has full title deeds.", "amenities": ["Borehole", "Double Storey", "Entertainment Area", "Main En Suite", "Tiled", "Walled", null]}
{"Listing_ref": "Listing ref: LNVP213611", "Company": "/estate-agents/leanvest-properties", "Agent": "Memory Jerahuni", "Price": "USD 800,000 ", "Surbub": " Glen Lorne", "City": " Harare North", "Province": " Harare", "bedrooms": "5", "bathrooms": "", "building_area": "", "land_area": "1 Acres", "Description": "The property is located in a gated community in Glen Lorne (within boomgate) with Full title deeds,1 acre of prime land, Borehole with 10,000L water tank, 70,000L water reservoir, Solar power and solar geyser. The Property Features 5 spacious bedrooms, each with walk-in closet and en-suite bathroom, Main bedroom boasts a balcony with stunning views. Modern, fully fitted kitchen with granite tops, center island, walk-in pantry, and separate scullery, Open-plan lounge and dining area, Second lounge, Entertainment area and bar, Office/Study, Gym, Double garage, 1-bedroom cottage with kitchen and lounge, Secure area within boomgate", "amenities": ["Borehole", "Double Storey", "Entertainment Area", null]}
{"Listing_ref": "Listing ref: PGP217756", "Company": "/estate-agents/pam-golding", "Agent": "Melody Phakathi", "Price": "USD 250,000 ", "Surbub": " Burnside", "City": " Bulawayo East", "Province": " Bulawayo", "bedrooms": "5", "bathrooms": "4", "building_area": "", "land_area": "5,800 m²", "Description": "Discover an exceptional opportunity with this luxurious 5800sqm property located in Burnside, Bulawayo. The main house showcases a striking angular design, topped with a vibrant red metal roof, harmoniously blending contemporary style with the surrounding greenery. The entrance, framed by solid wooden columns and stone steps, leads you into an enticing living space. Inside, five spacious bedrooms and bathrooms offer comfort and privacy, complemented by a cozy lounge, a dining room ideal for entertaining, and a functional office/study area. Outside, the expansive grounds provide ample room for gardens or recreational activities, bordered by a low wall that ensures privacy. Solar panels atop the roof highlight the property’s sustainable features, allowing for eco-friendly living. Additionally, the property includes two charming cottages, each with unique architectural designs—one reflecting traditional aesthetics and the other a modern flair. This estate, with its borehole for water supply and beautiful landscaping, is perfect for those seeking tranquility and luxury in Bulawayo.", "amenities": ["Borehole", "Fitted Kitchen", "Good ZESA", "Gravel Roads", "Main En Suite", "Municipal Water", "Solar System", "Staff Quarters", "Study/Office", "Tiled", "Verandah", "Walled", "Water Tank", null]}
{"Listing_ref": "Listing ref: PGP218434", "Company": "/estate-agents/pam-golding", "Agent": "Jessica Ferreira", "Price": "USD 450,000 ", "Surbub": " Helensvale", "City": " Harare North", "Province": " Harare", "bedrooms": "4", "bathrooms": "4", "building_area": "", "land_area": "2,548 m²", "Description": "Pam Golding Properties are proud to present this impressive double storey home sitting on 2548sqm, this beautifully crafted home offers space, style and a warm sense of family living. From the moment you step onto the stunning stone floors and take in the sweeping staircase, its clear this property has been thoughtfully designed comprising of: 4 large bedrooms Spacious Primary bedroom suite includes en-suite, walk in wardrobe 2 lounges- main sunken lounge downstairs and 2nd lounge upstairs Renovated fitted kitchen and scullery Large family dining room Entrance hall Office Fireplace 4 bathrooms total Guest loo Upstairs balcony Additional Features: Double lock up garage Double domestic quarters Storeroom Borehole.", "amenities": ["Borehole", "Double Storey", "Electric Gate", "Fireplace", "Fitted Kitchen", "Garage", "Garden", "Main En Suite", "Paved", "Staff Quarters", "Study/Office", "Tiled", "Water Tank", null]}
{"Listing_ref": "Listing ref: SEF215706", "Company": "/estate-agents/seeff", "Agent": "Sindi Mangiza", "Price": "USD 120,000 ", "Surbub": " Haig Park", "City": " Harare West", "Province": " Harare", "bedrooms": "3", "bathrooms": "1", "building_area": "", "land_area": "890 m²", "Description": "", "amenities": ["Borehole", "Carport", "Fireplace", "Flatlet/Cottage", "Garden", "Good ZESA", "Main Road Frontage", "Municipal Water", "Paved", "Sewer System", "Tarred Roads", "Tiled", "Verandah", "Walled", "Water Tank", null]}
{"Listing_ref": "Listing ref: SEF209561", "Company": "/estate-agents/seeff", "Agent": "Kendra ", "Price": "USD 130,000 ", "Surbub": " Queens Park East", "City": " Bulawayo North", "Province": " Bulawayo", "bedrooms": "5", "bathrooms": "2", "building_area": "", "land_area": "1,500 m²", "Description": "This exquisite 5-bedroom residence offers the ultimate in family living. The master suite, complete with a private ensuite bathroom, provides a serene sanctuary. The additional family bathroom and separate toilet cater to the needs of the entire household. The spacious open-plan dining and lounge areas, enhanced by three inviting verandas, create ideal spaces for relaxation and entertaining guests. The modern kitchen, equipped with built-in cupboards and a  hob is a chef's delight. For added convenience and sustainability, the property features a double lock-up garage, a 2500L water tank, a borehole, and a 5kva solar system. The interior is elegantly finished with fully tiled floors, ceilings, and primer-painted walls. Security is paramount, with razor wire, walls, and a gate providing peace of mind.", "amenities": ["Borehole", "Electric Fence", "Fireplace", "Fitted Kitchen", "Garage", "Garden", "Main En Suite", "Municipal Water", "Parking bay", "Sewer System", "Solar System", "Tiled", "Verandah", "Walled", "Water Tank", null]}
{"Listing_ref": "Listing ref: GAT207200", "Company": "/estate-agents/guest-and-tanner", "Agent": "Lovemore Matula", "Price": "USD 730,000 ", "Surbub": " Glen Lorne", "City": " Harare North", "Province": " Harare", "bedrooms": "5", "bathrooms": "", "building_area": "", "land_area": "4,263 m²", "Description": "Set on a sprawling 4,263 m² stand featuring panoramic views, this stunning double-storey home boasts 5 bedrooms, including a master suite with a dressing closet and en-suite. All bedrooms feature secure balconies offering breathtaking views of the valley and hills. The home includes two lounges, both with fireplaces, with one featuring heated tiles for added winter comfort. The dining area is perfectly positioned next to a modern kitchen with a scullery and walk-in pantry. Additional highlights include 2 study rooms, a gym with a shower and toilet, a guest wing with a bedroom, kitchenette, and bathroom, an automated triple garage, and a library. This property ensures comfort and sustainability with a 5kV solar system, a borehole located in the valley for a reliable water supply, and 10 multi-capacity water tanks. The security system includes an electric gate, fencing, and an alarm. For entertainment, enjoy a dedicated area with a kitchen, bar, and toilet, overlooking a sparkling pool with a stunning water feature, set amidst a mature garden adorned with", "amenities": ["Swimming Pool", "Electric Fence", "Electric Gate", "Entertainment Area", "Fireplace", "Fitted Kitchen", "Flatlet/Cottage", "Garage", "Garden", "Good ZESA", "Main En Suite", "Paved", "Solar System", "Tarred Roads", "Tiled", "Verandah", "Walled", "Water Tank", null]}
{"Listing_ref": "Listing ref: LNVP213589", "Company": "/estate-agents/leanvest-properties", "Agent": "Stephen Machingura", "Price": "USD 360,000 ", "Surbub": " Gletwin Park", "City": " Harare North", "Province": " Harare", "bedrooms": "5", "bathrooms": "2", "building_area": "", "land_area": "1,986 m²", "Description": "", "amenities": [null]}
